Revit 2026 API

# SolidGlassSolidglassRefractionIor Property

---

The property labeled "Refraction" from the "SolidGlass" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string SolidglassRefractionIor { get; }
```
```vb
Public Shared ReadOnly Property SolidglassRefractionIor As String
	Get
```
```cpp
public:
static property String^ SolidglassRefractionIor {
	String^ get ();
}
```
```fsharp
static member SolidglassRefractionIor : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble" within the range of "0.01, 5".

#### Reference

SolidGlass Class

Autodesk.Revit.DB.Visual Namespace